{
  "id": "/2015/02/01/bref-on-fait-une-conference",
  "title": "Bref, on a fait une conférence",
  "url": "http://meetups.pixelastic.com//2015/02/01/bref-on-fait-une-conference/",
  "tags": [
    "bref"
  ],
  "date": 1422745200,
  "html": "<p>Vendredi soir avait lieu au <a href=\"http://www.theatredurondpoint.fr/\">théatre du Rond-Point</a> une conférence de\n<a href=\"https://twitter.com/kyank\">Kyan</a> et <a href=\"https://twitter.com/Navo_\">Navo</a> sur leur processus créatif lors de la conception de la\nsérie <a href=\"https://www.youtube.com/user/bref\">Bref</a>. J&#39;avais déjà eu la chance d&#39;écouter cette conférence il\ny a quelques mois, mais la voir en live cette fois-ci m&#39;a donné envie de\npartager un compte-rendu des conseils qui y étaient donnés.</p>\n\n<p>Leurs conseils viennent de leur expérience dans la création d&#39;une série courte\ncomique, mais la trés grande majorité des conseils peuvent s&#39;appliquer\nà n&#39;importe quel acte de création, depuis l&#39;écriture d&#39;un roman à la fondation\nd&#39;une startup.</p>\n\n<h3>Vous avez quelque chose à dire</h3>\n\n<p>Le premier conseil pour se lancer est de ne pas croire qu&#39;on n&#39;a rien\nd&#39;intéressant à dire ou à offrir. On était une centaine dans la salle\nà assister à la même conférence, néanmoins si on avait du chacun écrire sur un\npapier notre expérience, on aurait tous raconté quelque chose de différent. Un\nmême événement peut être raconté de manières complétement différentes et aucune\nn&#39;est plus légitime qu&#39;une autre.</p>\n\n<h3>Just do it.</h3>\n\n<p>Au delà du slogan de Nike, cet adage est l&#39;un des plus importants pour moi.\nC&#39;est bien beau d&#39;avoir des idées, mais sans leur réalisation, l&#39;idée ne vaut\nrien. J&#39;ai rencontré beaucoup d&#39;<em>entrepreneurs</em> qui étaient persuadés d&#39;avoir\nl&#39;idée du siècle et qui avaient <em>juste</em> besoin d&#39;un développeur pour la\nréaliser.</p>\n\n<p>C&#39;est pas comme ça que ça marche. C&#39;est extrémement simple d&#39;avoir des idées.\nTout le monde a des idées, et c&#39;est même très probable que d&#39;autres personnes\naient exactement les mêmes idées que vous. Mais imaginer un concept ou un\nproduit dans sa tête c&#39;est trop facile. Tout le monde peut être un génie\ndans sa propre tête. C&#39;est quand on sort son idée dans le monde réel que la\nvéritable aventure commence.</p>\n\n<p>Parce qu&#39;une fois qu&#39;on la sort dans le monde extérieur, qu&#39;on la confronte\nà d&#39;autres personnes, à un marché, on risque de se prendre des murs, on risque\nde se planter. Notre si belle idée n&#39;est finalement peut-être pas viable. Mais\nsans cette étape, on ne l&#39;aurait jamais su. Il est donc indispensable de faire\ndes choses, de passer son idée de simple concept à une réalisation concrète.</p>\n\n<p>Des gens qui ont des idées il doit y en avoir approximativement 7 milliards sur\nTerre. Des gens qui réalisent quelque chose à partir de ces idées, il y en\na déjà beaucoup moins, et ceux qui parviennent au bout de leur réalisation sont\nvraiment très peu.</p>\n\n<p>Faites des choses, tentez, essayez, plantez-vous. Si vous ne vous plantez pas,\nc&#39;est que vous n&#39;avez pas innové. Si vous réussissez du premier coup, c&#39;est que\nvotre idée n&#39;a rien de révolutionnaire.</p>\n\n<h3>Dumpez</h3>\n\n<p>Adeptes du <a href=\"http://fr.wikipedia.org/wiki/Getting_Things_Done\">GTD</a> ou de <a href=\"http://ankisrs.net/\">Anki</a>, vous devez connaitre ce principe. Dumpez.\nNe laissez pas votre esprit être encombré de trop de choses. Vous avez une\nidée, notez là dans un carnet, envoyez-vous un mail, mettez là sur\n<a href=\"https://evernote.com/intl/fr/\">Evernote</a>. Vous ne pourrez sans doute rien en\nfaire aujourd&#39;hui, mais au moins vous l&#39;avez notée et un jour viendra où vous\npourrez vous en resservir.</p>\n\n<p>Kyan donne l&#39;exemple du carnet dans lequel il note le nom des acteurs qu&#39;il\na aimé voir au théatre. Navo écrit sur son blog depuis des années des tas de\npensées. En quand ils ont du réaliser Bref, ils ont acceléré leur casting grâce\nau carnet de Kyan, et ont pu transformer des notes de blog en épisodes.</p>\n\n<p>Lors de l&#39;écriture de Bref, ils ont balancé en vrac toutes les vannes, tous les\ntrucs drôles qu&#39;ils avaient en tête et dans leurs carnets. Ensuite, ils les ont\nregroupés sous des thèmes communs, qui ont ensuite donné lieu aux épisodes. Ils\nappellent cette technique des &quot;jouets et des chambres&quot;. J&#39;utilise quelque chose\nde très similaire quand j&#39;écris mes scènarios de jeu de rôle et ça permet\nd&#39;avoir une matière première très facilement.</p>\n\n<h3>N&#39;ayez pas peur de montrer ce que vous faites</h3>\n\n<p>Je vois beaucoup d&#39;entrepreneurs qui ne veulent pas parler de leurs idées de\npeur de se les faire voler. Encore une fois, les idées ne valent rien sans leur\nréalisation. Mais surtout, en empechant l&#39;idée se se faire connaitre ils\nempechent complétement leur projet d&#39;aboutir.</p>\n\n<p>Peut-être allez-vous vous faire voler votre idée. Et alors ? Des idées vous en\naurez d&#39;autres, non ? Je l&#39;espère pour vous en tout cas. Si vous pensez que\nvous n&#39;avez eu qu&#39;une seule bonne idée de toute votre vie, laissez moi vous\ndire qu&#39;il y a peu de chance que cette idée soit bonne. </p>\n\n<p>Les gens qui ont des bonnes idées les ont par dizaines. Ce sont des poules aux\nœufs d&#39;or. Ils pourront continuer d&#39;en avoir, même si on leur en vole une.\nAlors que les voleurs sont incapables d&#39;avoir des idées. En vous volant votre\nidée, le voleur vous a rendu service. Vous savez que c&#39;est un voleur\nmaintenant, et vous ne lui ferez plus confiance et vous ne vous ferez pas voler\nvotre prochaine idée qui est encore mieux.</p>\n\n<p>De toutes façons, vous y gagnerez plus à vous faire voler une idée et la voir\ngrandir dans le monde réel, même si vous n&#39;y participez pas, plutot que de ne\nrien produire du tout.</p>\n\n<p>Encore une fois, tout le monde a des idées, mais peu de personnes sont capables\nde les réaliser. C&#39;est pas grave de se faire piquer des idées, c&#39;est pas ça qui\nmanque. Et on ne peut pas vous voler votre capacité de réalisation, c&#39;est ça\nqui compte.</p>\n\n<p>J&#39;ai beaucoup aimé le petit dialogue imagé entre Kyan et Navo sur ce sujet :</p>\n\n<blockquote>\n<p>— Oh, j&#39;ai une super idée.</p>\n\n<p>— Ah ouais, c&#39;est quoi ?</p>\n\n<p>— Nan, je peux pas te le dire, tu va me la voler.</p>\n\n<p>— Ah. Ben viens, je te présente quelqu&#39;un.</p>\n\n<p>— Nan, nan. Il va me voler mon idée lui aussi.</p>\n\n<p>— Comme tu veux...</p>\n\n<p>— C&#39;était qui d&#39;ailleurs ?</p>\n\n<p>— Le succès.</p>\n</blockquote>\n\n<h3>Ayez de la chance</h3>\n\n<p>Ce conseil parait idiot, mais c&#39;est l&#39;un des conseils les plus importants pour\nréussir. Personne ne parvient à créer quelque chose de neuf sans avoir de la\nchance. Mais surtout la chance, ça se provoque.</p>\n\n<p>Navo aime à raconter l&#39;histoire de cet homme très croyant qui jour après jour,\npendant des années, prie Dieu pour lui demander de le faire gagner au loto. Si\nbien qu&#39;après des années Dieu lui apparait et lui dit : &quot;Écoute, je veux bien\nte faire gagner au loto. Mais s&#39;il te plait, joue.&quot;</p>\n\n<p>Beaucoup de gens pensent que la chance arrive comme ça, sans raison. Qu&#39;un jour\nun producteur ou un investisseur va venir frapper à votre porte alors que vous\nêtes chez vous en slip en train de réfléchir à votre idée et vous proposer\nbeaucoup d&#39;argent pour enfin la réaliser.</p>\n\n<p>Non.</p>\n\n<p>Ça ne marche pas comme ça. Avant de pouvoir récolter de la chance, il faut\nsavoir semer du risque. La chance, ça se provoque. Il faut tenter des choses,\nse faire voir, rencontrer du monde, partager, montrer ce qu&#39;on fait. Le talent\net la créativité ne font pas tout, la chance a aussi une part énorme à jouer.</p>\n\n<p>Il faut savoir accepter la chance, la respecter, et la provoquer.</p>\n\n<h3>Créez votre famille</h3>\n\n<p>Même quand vous faites quelque chose de chiant, faites-le bien. Si vous\ntravaillez un jour avec quelqu&#39;un et que vous faites un sale boulot, il s&#39;en\nsouviendra et le jour où il aura besoin de quelqu&#39;un pour monter son projet,\nvous pouvez être sur que ce n&#39;est pas vous qu&#39;il appelera.</p>\n\n<p>Encore une fois, le plus important c&#39;est pas l&#39;idée, c&#39;est l&#39;équipe qui va la\nréaliser. Il y a des gens avec qui on a travaillé, on a apprécié leur travail\nautant que leur personne, on sait qu&#39;on les rappellera pour travailler\nà nouveau avec eux dans le futur. On sait qu&#39;on peut leur faire confiance, on\nsait comment ils travaillent, on est dans une ambiance de bienveillance.</p>\n\n<p>Vous ne savez jamais si le petit boulot que vous êtes en train de faire\naujourd&#39;hui ne vous permettra pas de faire quelque chose de bien plus grand\nplus tard, simplement parce qu&#39;on se souvient de vous comme quelqu&#39;un qui bosse\nbien.</p>\n\n<h3>Ne laissez pas l&#39;argent vous brider</h3>\n\n<p>Et bizarrement quand je dis ça, je ne pense pas au manque d&#39;argent, mais au\nsurplus d&#39;argent. À un moment, votre projet fonctionnera. Vous gagnerez des\nsous avec et se posera la question de quoi faire avec ces montants.</p>\n\n<p>Vous vous souviendrez du moment où vous avez commencé, où vous avez réussi\nà faire beaucoup avec peu de moyens. Maintenant on vous offre un chèque avec\nplein de zeros pour continuer. Il pourrait être tentant de se dire &quot;<em>Bon, je\nvais faire juste 90% de ce que j&#39;avais prévu, ce qui est déjà bien, et garder\nles 10% restant pour ma poche</em>&quot;.</p>\n\n<p>Non.</p>\n\n<p>Il faut que vous fassiez 110% de ce que vous aviez prévu. Mettez vous en galère,\nallez plus loin encore. Ce n&#39;est que le début. Vous serez riche plus tard. Là\nvous avez encore beaucoup à apprendre, beaucoup à prouver, il ne faut pas\ns&#39;arreter maintenant. En faisant ainsi, vous vous donnerez à fond et irez\nencore plus loin.</p>\n\n<p>Le plus mauvais conseil qu&#39;on puisse vous donner quand vous monter votre projet\nviens bien souvent de vos proches. Ils voient que votre idée fonctionne et vous\ndisent &quot;<em>T&#39;es payé combien ? Fais attention à ne pas te faire avoir</em>&quot;.</p>\n\n<p>Worst advice ever.</p>\n\n<p>Après ça vous allez avoir un petit démon dans un coin de votre tête qui va\nvenir vous emmerder à chaque fois que vous aller pondre une nouvelle idée. Vous\nallez brider votre créativité en vous disant &quot;<em>Non, je mérite mieux que ça</em>&quot;,\n&quot;<em>Ça, je le garde pour moi</em>&quot;. On s&#39;en fout de combien vous êtes payé, vous\nfaites ce que vous rêvez de faire, ne laissez pas une hypothétique somme\nd&#39;argent vous brider avant même d&#39;avoir commencé.</p>\n\n<p>Ils sont nombreux les groupes de rock fondés par des gamsin de 15 ans qui\nsplittent avant même d&#39;avoir écrit leur première chanson car ils se voient déjà\nen haut de l&#39;affiche et s&#39;engueulent pour savoir comment partager les gains de\nleur hit idéalisé. Ne soyez pas ces gamins. Faites.</p>\n\n<h3>La contrainte peut être libératrice</h3>\n\n<p>Parfois une contrainte, un impondérable va vous forcer à revoir vos plans. Ce\nque vous aviez prévu de faire ne peut pas être fait comme prévu. Vous avez\nalors deux choix : annuler ou trouver une solution.</p>\n\n<p>Et c&#39;est bien souvent quand on a des contraintes fortes qu&#39;on parvient\nà trouver des solutions créatives que nous n&#39;aurions autrement jamais\nimaginées. Et ces solutions peuvent bien souvent être aussi utilisées dans des\nsituations normales, là où la contrainte n&#39;existe pas, pour rendre le process\nencore plus agréable, rapide, utile.</p>\n\n<p>Ne vous découragez pas face à une contrainte, il y a forcément une solution, et\nbien souvent elle vous ferez explorer quelque chose d&#39;inédit.</p>\n\n<h3>Qu&#39;est-ce qu&#39;un gars plus fort que moi ferai ?</h3>\n\n<p>Quand vous avez réussi à faire ce que vous vouliez, que vous pensez en avoir\nfini, demandez-vous &quot;<em>Qu&#39;est-ce qu&#39;un gars plus fort que moi ferai à ma place\n?</em>&quot;. En essayant de vous mettre dans la peau de quelqu&#39;un plus fort que vous,\nvous parviendrez à être plus fort que vous même.</p>\n\n<p>Ça parait bizarre comme conseil, mais essayez, vous verrez.</p>\n\n<h3><a href=\"http://www.partageons-ce-qui-nous-departage.com/le-non-est-toujours-acquis\">Le non est toujours acquis</a></h3>\n\n<p>Bien souvent, vous allez rencontrer des gens dans des métiers annexes au votre\navec qui vous devez intéragir qui vont vous dire &quot;<em>Nope, désolé, c&#39;est pas\npossible.</em>&quot;. Bien souvent, en creusant un peu, vous comprendrez que ce n&#39;est pas\npour eux que la tache est impossible, mais parce qu&#39;ils pensent que quelqu&#39;un\nd&#39;autre, un peu plus loin dans la chaine ne voudra pas.</p>\n\n<p>Si vous commencez à entendre des choses comme &quot;<em>Non mais c&#39;est même pas la\npeine d&#39;essayer, ils voudront jamais</em>&quot;, &quot;<em>Ça fait 15 ans que je fais ce métier,\nje peux te dire qu&#39;ils ne voudront pas.</em>&quot;. Répondez simplement &quot;<em>Viens, on\nessaye.</em>&quot;, &quot;<em>Viens, on essaye</em>&quot; jusqu&#39;à ce qu&#39;il accepte effectivement\nd&#39;essayer.</p>\n\n<p>Et vous serez surpris du nombre de fois où finalement il n&#39;y avait pas de réel\nobstacle sur la voie, juste des gens qui pensent que des gens pensent qu&#39;il va\ny avoir des obstacles et donc bloquent dès le début. </p>\n\n<p>Et ça n&#39;arrive pas qu&#39;aux autres. Faites attention à la petite voix dans votre\ntête qui dit &quot;<em>Non, ils voudront pas, c&#39;est pas la peine que je demande</em>&quot; aussi.</p>\n\n<h3>Consensus</h3>\n\n<p>Quand on monte un projet à plusieurs, il est fondamental que les idées mises en\nplace plaisent à tout le monde. Si vous devez batailler pour convaincre l&#39;autre\nque votre idée est bonne, changez d&#39;idée. N&#39;oubliez pas que vous êtes des\npoules aux œufs d&#39;or. Bien souvent il existe une autre idée qui satisfait tout\nle monde pile entre la votre et celle de votre associé.</p>\n\n<p>Si jamais on vous impose une idée et que le projet ne fonctionne pas, vous\nserez tenté de dire &quot;<em>Ouais mais je le savais, j&#39;en voulais pas de ça moi.</em>&quot;.\nEt au contraire si c&#39;est votre idée qui est acceptée et que le projet\nfonctionne, vous aller penser &quot;<em>Je le savais, mes idées sont vraiment\nmeilleures</em>&quot;. Et les rancunes et les dissenssions vont commencer à partir de\nlà.</p>\n\n<p>Trouvez une idée avec laquelle vous soyez tous d&#39;accord, que vous puissiez tous\ndéfendre et porter. Si votre idée ne convient pas, pas de soucis, trouvez-en\nune autre et gardez votre idée pour un autre projet.</p>\n\n<h3>Attention aux détails</h3>\n\n<p>Octroyez-vous le pouvoir de tout maitriser, toute la chaine, jusqu&#39;au bout.\nMême si vous avez fait le gros du travail, faites attention aux petits détails,\ntout le temps, partout.</p>\n\n<p>Kyan raconte une anecdote très vraie d&#39;un magicien américain qui vient faire un\nspectacle en France. Il répète son tour depuis des années, il est parfaitement\nau point, il s&#39;est beaucoup investi dedans, il a même divorcé à cause de ça. Il\nest capable de faire téléporter une petite fille depuis un bout de la scène\nvers l&#39;autre.</p>\n\n<p>Et au moment de monter sur scène, le présentateur l&#39;annonce avec :</p>\n\n<blockquote>\n<p>Mesdames et messieurs, un tonnerre d&#39;applaudissement pour Maurice et ses\njumelles !</p>\n</blockquote>\n\n<p>Comme quoi, il faut faire attention à tous les détails jusqu&#39;au bout.</p>\n\n<h3>Conclusion</h3>\n\n<p>Ce sont pour moi des conseils extrémement précieux. Certains s&#39;appliquent\nparticulièrement à un processus créatif, mais d&#39;autres possèdent vraiment une\nportée bien plus générale.</p>\n\n<p>J&#39;espère que vous aurez tiré quelque chose de cet article comme moi j&#39;ai tiré\nquelque chose de ces conseils.</p>\n",
  "markdown": "Vendredi soir avait lieu au [théatre du Rond-Point][1] une conférence de\r\n[Kyan][2] et [Navo][3] sur leur processus créatif lors de la conception de la\r\nsérie [Bref][4]. J'avais déjà eu la chance d'écouter cette conférence il\r\ny a quelques mois, mais la voir en live cette fois-ci m'a donné envie de\r\npartager un compte-rendu des conseils qui y étaient donnés.\r\n\r\nLeurs conseils viennent de leur expérience dans la création d'une série courte\r\ncomique, mais la trés grande majorité des conseils peuvent s'appliquer\r\nà n'importe quel acte de création, depuis l'écriture d'un roman à la fondation\r\nd'une startup.\r\n\r\n### Vous avez quelque chose à dire\r\n\r\nLe premier conseil pour se lancer est de ne pas croire qu'on n'a rien\r\nd'intéressant à dire ou à offrir. On était une centaine dans la salle\r\nà assister à la même conférence, néanmoins si on avait du chacun écrire sur un\r\npapier notre expérience, on aurait tous raconté quelque chose de différent. Un\r\nmême événement peut être raconté de manières complétement différentes et aucune\r\nn'est plus légitime qu'une autre.\r\n\r\n### Just do it.\r\n\r\nAu delà du slogan de Nike, cet adage est l'un des plus importants pour moi.\r\nC'est bien beau d'avoir des idées, mais sans leur réalisation, l'idée ne vaut\r\nrien. J'ai rencontré beaucoup d'_entrepreneurs_ qui étaient persuadés d'avoir\r\nl'idée du siècle et qui avaient _juste_ besoin d'un développeur pour la\r\nréaliser.\r\n\r\nC'est pas comme ça que ça marche. C'est extrémement simple d'avoir des idées.\r\nTout le monde a des idées, et c'est même très probable que d'autres personnes\r\naient exactement les mêmes idées que vous. Mais imaginer un concept ou un\r\nproduit dans sa tête c'est trop facile. Tout le monde peut être un génie\r\ndans sa propre tête. C'est quand on sort son idée dans le monde réel que la\r\nvéritable aventure commence.\r\n\r\nParce qu'une fois qu'on la sort dans le monde extérieur, qu'on la confronte\r\nà d'autres personnes, à un marché, on risque de se prendre des murs, on risque\r\nde se planter. Notre si belle idée n'est finalement peut-être pas viable. Mais\r\nsans cette étape, on ne l'aurait jamais su. Il est donc indispensable de faire\r\ndes choses, de passer son idée de simple concept à une réalisation concrète.\r\n\r\nDes gens qui ont des idées il doit y en avoir approximativement 7 milliards sur\r\nTerre. Des gens qui réalisent quelque chose à partir de ces idées, il y en\r\na déjà beaucoup moins, et ceux qui parviennent au bout de leur réalisation sont\r\nvraiment très peu.\r\n\r\nFaites des choses, tentez, essayez, plantez-vous. Si vous ne vous plantez pas,\r\nc'est que vous n'avez pas innové. Si vous réussissez du premier coup, c'est que\r\nvotre idée n'a rien de révolutionnaire.\r\n\r\n### Dumpez\r\n\r\nAdeptes du [GTD][5] ou de [Anki][6], vous devez connaitre ce principe. Dumpez.\r\nNe laissez pas votre esprit être encombré de trop de choses. Vous avez une\r\nidée, notez là dans un carnet, envoyez-vous un mail, mettez là sur\r\n[Evernote][7]. Vous ne pourrez sans doute rien en\r\nfaire aujourd'hui, mais au moins vous l'avez notée et un jour viendra où vous\r\npourrez vous en resservir.\r\n\r\nKyan donne l'exemple du carnet dans lequel il note le nom des acteurs qu'il\r\na aimé voir au théatre. Navo écrit sur son blog depuis des années des tas de\r\npensées. En quand ils ont du réaliser Bref, ils ont acceléré leur casting grâce\r\nau carnet de Kyan, et ont pu transformer des notes de blog en épisodes.\r\n\r\nLors de l'écriture de Bref, ils ont balancé en vrac toutes les vannes, tous les\r\ntrucs drôles qu'ils avaient en tête et dans leurs carnets. Ensuite, ils les ont\r\nregroupés sous des thèmes communs, qui ont ensuite donné lieu aux épisodes. Ils\r\nappellent cette technique des \"jouets et des chambres\". J'utilise quelque chose\r\nde très similaire quand j'écris mes scènarios de jeu de rôle et ça permet\r\nd'avoir une matière première très facilement.\r\n\r\n### N'ayez pas peur de montrer ce que vous faites\r\n\r\nJe vois beaucoup d'entrepreneurs qui ne veulent pas parler de leurs idées de\r\npeur de se les faire voler. Encore une fois, les idées ne valent rien sans leur\r\nréalisation. Mais surtout, en empechant l'idée se se faire connaitre ils\r\nempechent complétement leur projet d'aboutir.\r\n\r\nPeut-être allez-vous vous faire voler votre idée. Et alors ? Des idées vous en\r\naurez d'autres, non ? Je l'espère pour vous en tout cas. Si vous pensez que\r\nvous n'avez eu qu'une seule bonne idée de toute votre vie, laissez moi vous\r\ndire qu'il y a peu de chance que cette idée soit bonne. \r\n\r\nLes gens qui ont des bonnes idées les ont par dizaines. Ce sont des poules aux\r\nœufs d'or. Ils pourront continuer d'en avoir, même si on leur en vole une.\r\nAlors que les voleurs sont incapables d'avoir des idées. En vous volant votre\r\nidée, le voleur vous a rendu service. Vous savez que c'est un voleur\r\nmaintenant, et vous ne lui ferez plus confiance et vous ne vous ferez pas voler\r\nvotre prochaine idée qui est encore mieux.\r\n\r\nDe toutes façons, vous y gagnerez plus à vous faire voler une idée et la voir\r\ngrandir dans le monde réel, même si vous n'y participez pas, plutot que de ne\r\nrien produire du tout.\r\n\r\nEncore une fois, tout le monde a des idées, mais peu de personnes sont capables\r\nde les réaliser. C'est pas grave de se faire piquer des idées, c'est pas ça qui\r\nmanque. Et on ne peut pas vous voler votre capacité de réalisation, c'est ça\r\nqui compte.\r\n\r\nJ'ai beaucoup aimé le petit dialogue imagé entre Kyan et Navo sur ce sujet :\r\n\r\n> — Oh, j'ai une super idée.\r\n>\r\n> — Ah ouais, c'est quoi ?\r\n>\r\n> — Nan, je peux pas te le dire, tu va me la voler.\r\n>\r\n> — Ah. Ben viens, je te présente quelqu'un.\r\n>\r\n> — Nan, nan. Il va me voler mon idée lui aussi.\r\n>\r\n> — Comme tu veux...\r\n>\r\n> — C'était qui d'ailleurs ?\r\n>\r\n> — Le succès.\r\n\r\n### Ayez de la chance\r\n\r\nCe conseil parait idiot, mais c'est l'un des conseils les plus importants pour\r\nréussir. Personne ne parvient à créer quelque chose de neuf sans avoir de la\r\nchance. Mais surtout la chance, ça se provoque.\r\n\r\nNavo aime à raconter l'histoire de cet homme très croyant qui jour après jour,\r\npendant des années, prie Dieu pour lui demander de le faire gagner au loto. Si\r\nbien qu'après des années Dieu lui apparait et lui dit : \"Écoute, je veux bien\r\nte faire gagner au loto. Mais s'il te plait, joue.\"\r\n\r\nBeaucoup de gens pensent que la chance arrive comme ça, sans raison. Qu'un jour\r\nun producteur ou un investisseur va venir frapper à votre porte alors que vous\r\nêtes chez vous en slip en train de réfléchir à votre idée et vous proposer\r\nbeaucoup d'argent pour enfin la réaliser.\r\n\r\nNon.\r\n\r\nÇa ne marche pas comme ça. Avant de pouvoir récolter de la chance, il faut\r\nsavoir semer du risque. La chance, ça se provoque. Il faut tenter des choses,\r\nse faire voir, rencontrer du monde, partager, montrer ce qu'on fait. Le talent\r\net la créativité ne font pas tout, la chance a aussi une part énorme à jouer.\r\n\r\nIl faut savoir accepter la chance, la respecter, et la provoquer.\r\n\r\n### Créez votre famille\r\n\r\nMême quand vous faites quelque chose de chiant, faites-le bien. Si vous\r\ntravaillez un jour avec quelqu'un et que vous faites un sale boulot, il s'en\r\nsouviendra et le jour où il aura besoin de quelqu'un pour monter son projet,\r\nvous pouvez être sur que ce n'est pas vous qu'il appelera.\r\n\r\nEncore une fois, le plus important c'est pas l'idée, c'est l'équipe qui va la\r\nréaliser. Il y a des gens avec qui on a travaillé, on a apprécié leur travail\r\nautant que leur personne, on sait qu'on les rappellera pour travailler\r\nà nouveau avec eux dans le futur. On sait qu'on peut leur faire confiance, on\r\nsait comment ils travaillent, on est dans une ambiance de bienveillance.\r\n\r\nVous ne savez jamais si le petit boulot que vous êtes en train de faire\r\naujourd'hui ne vous permettra pas de faire quelque chose de bien plus grand\r\nplus tard, simplement parce qu'on se souvient de vous comme quelqu'un qui bosse\r\nbien.\r\n\r\n### Ne laissez pas l'argent vous brider\r\n\r\nEt bizarrement quand je dis ça, je ne pense pas au manque d'argent, mais au\r\nsurplus d'argent. À un moment, votre projet fonctionnera. Vous gagnerez des\r\nsous avec et se posera la question de quoi faire avec ces montants.\r\n\r\nVous vous souviendrez du moment où vous avez commencé, où vous avez réussi\r\nà faire beaucoup avec peu de moyens. Maintenant on vous offre un chèque avec\r\nplein de zeros pour continuer. Il pourrait être tentant de se dire \"_Bon, je\r\nvais faire juste 90% de ce que j'avais prévu, ce qui est déjà bien, et garder\r\nles 10% restant pour ma poche_\".\r\n\r\nNon.\r\n\r\nIl faut que vous fassiez 110% de ce que vous aviez prévu. Mettez vous en galère,\r\nallez plus loin encore. Ce n'est que le début. Vous serez riche plus tard. Là\r\nvous avez encore beaucoup à apprendre, beaucoup à prouver, il ne faut pas\r\ns'arreter maintenant. En faisant ainsi, vous vous donnerez à fond et irez\r\nencore plus loin.\r\n\r\nLe plus mauvais conseil qu'on puisse vous donner quand vous monter votre projet\r\nviens bien souvent de vos proches. Ils voient que votre idée fonctionne et vous\r\ndisent \"_T'es payé combien ? Fais attention à ne pas te faire avoir_\".\r\n\r\nWorst advice ever.\r\n\r\nAprès ça vous allez avoir un petit démon dans un coin de votre tête qui va\r\nvenir vous emmerder à chaque fois que vous aller pondre une nouvelle idée. Vous\r\nallez brider votre créativité en vous disant \"_Non, je mérite mieux que ça_\",\r\n\"_Ça, je le garde pour moi_\". On s'en fout de combien vous êtes payé, vous\r\nfaites ce que vous rêvez de faire, ne laissez pas une hypothétique somme\r\nd'argent vous brider avant même d'avoir commencé.\r\n\r\nIls sont nombreux les groupes de rock fondés par des gamsin de 15 ans qui\r\nsplittent avant même d'avoir écrit leur première chanson car ils se voient déjà\r\nen haut de l'affiche et s'engueulent pour savoir comment partager les gains de\r\nleur hit idéalisé. Ne soyez pas ces gamins. Faites.\r\n\r\n### La contrainte peut être libératrice\r\n\r\nParfois une contrainte, un impondérable va vous forcer à revoir vos plans. Ce\r\nque vous aviez prévu de faire ne peut pas être fait comme prévu. Vous avez\r\nalors deux choix : annuler ou trouver une solution.\r\n\r\nEt c'est bien souvent quand on a des contraintes fortes qu'on parvient\r\nà trouver des solutions créatives que nous n'aurions autrement jamais\r\nimaginées. Et ces solutions peuvent bien souvent être aussi utilisées dans des\r\nsituations normales, là où la contrainte n'existe pas, pour rendre le process\r\nencore plus agréable, rapide, utile.\r\n\r\nNe vous découragez pas face à une contrainte, il y a forcément une solution, et\r\nbien souvent elle vous ferez explorer quelque chose d'inédit.\r\n\r\n### Qu'est-ce qu'un gars plus fort que moi ferai ?\r\n\r\nQuand vous avez réussi à faire ce que vous vouliez, que vous pensez en avoir\r\nfini, demandez-vous \"_Qu'est-ce qu'un gars plus fort que moi ferai à ma place\r\n?_\". En essayant de vous mettre dans la peau de quelqu'un plus fort que vous,\r\nvous parviendrez à être plus fort que vous même.\r\n\r\nÇa parait bizarre comme conseil, mais essayez, vous verrez.\r\n\r\n### [Le non est toujours acquis][8]\r\n\r\nBien souvent, vous allez rencontrer des gens dans des métiers annexes au votre\r\navec qui vous devez intéragir qui vont vous dire \"_Nope, désolé, c'est pas\r\npossible._\". Bien souvent, en creusant un peu, vous comprendrez que ce n'est pas\r\npour eux que la tache est impossible, mais parce qu'ils pensent que quelqu'un\r\nd'autre, un peu plus loin dans la chaine ne voudra pas.\r\n\r\nSi vous commencez à entendre des choses comme \"_Non mais c'est même pas la\r\npeine d'essayer, ils voudront jamais_\", \"_Ça fait 15 ans que je fais ce métier,\r\nje peux te dire qu'ils ne voudront pas._\". Répondez simplement \"_Viens, on\r\nessaye._\", \"_Viens, on essaye_\" jusqu'à ce qu'il accepte effectivement\r\nd'essayer.\r\n\r\nEt vous serez surpris du nombre de fois où finalement il n'y avait pas de réel\r\nobstacle sur la voie, juste des gens qui pensent que des gens pensent qu'il va\r\ny avoir des obstacles et donc bloquent dès le début. \r\n\r\nEt ça n'arrive pas qu'aux autres. Faites attention à la petite voix dans votre\r\ntête qui dit \"_Non, ils voudront pas, c'est pas la peine que je demande_\" aussi.\r\n\r\n### Consensus\r\n\r\nQuand on monte un projet à plusieurs, il est fondamental que les idées mises en\r\nplace plaisent à tout le monde. Si vous devez batailler pour convaincre l'autre\r\nque votre idée est bonne, changez d'idée. N'oubliez pas que vous êtes des\r\npoules aux œufs d'or. Bien souvent il existe une autre idée qui satisfait tout\r\nle monde pile entre la votre et celle de votre associé.\r\n\r\nSi jamais on vous impose une idée et que le projet ne fonctionne pas, vous\r\nserez tenté de dire \"_Ouais mais je le savais, j'en voulais pas de ça moi._\".\r\nEt au contraire si c'est votre idée qui est acceptée et que le projet\r\nfonctionne, vous aller penser \"_Je le savais, mes idées sont vraiment\r\nmeilleures_\". Et les rancunes et les dissenssions vont commencer à partir de\r\nlà.\r\n\r\nTrouvez une idée avec laquelle vous soyez tous d'accord, que vous puissiez tous\r\ndéfendre et porter. Si votre idée ne convient pas, pas de soucis, trouvez-en\r\nune autre et gardez votre idée pour un autre projet.\r\n\r\n### Attention aux détails\r\n\r\nOctroyez-vous le pouvoir de tout maitriser, toute la chaine, jusqu'au bout.\r\nMême si vous avez fait le gros du travail, faites attention aux petits détails,\r\ntout le temps, partout.\r\n\r\nKyan raconte une anecdote très vraie d'un magicien américain qui vient faire un\r\nspectacle en France. Il répète son tour depuis des années, il est parfaitement\r\nau point, il s'est beaucoup investi dedans, il a même divorcé à cause de ça. Il\r\nest capable de faire téléporter une petite fille depuis un bout de la scène\r\nvers l'autre.\r\n\r\nEt au moment de monter sur scène, le présentateur l'annonce avec :\r\n\r\n> Mesdames et messieurs, un tonnerre d'applaudissement pour Maurice et ses\r\n> jumelles !\r\n\r\nComme quoi, il faut faire attention à tous les détails jusqu'au bout.\r\n\r\n### Conclusion\r\n\r\nCe sont pour moi des conseils extrémement précieux. Certains s'appliquent\r\nparticulièrement à un processus créatif, mais d'autres possèdent vraiment une\r\nportée bien plus générale.\r\n\r\nJ'espère que vous aurez tiré quelque chose de cet article comme moi j'ai tiré\r\nquelque chose de ces conseils.\r\n\r\n\r\n[1]: http://www.theatredurondpoint.fr/\r\n[2]: https://twitter.com/kyank\r\n[3]: https://twitter.com/Navo_\r\n[4]: https://www.youtube.com/user/bref\r\n[5]: http://fr.wikipedia.org/wiki/Getting_Things_Done\r\n[6]: http://ankisrs.net/\r\n[7]: https://evernote.com/intl/fr/\r\n[8]: http://www.partageons-ce-qui-nous-departage.com/le-non-est-toujours-acquis\r\n"
}